OdDAI.BinaryType.nameUpperCase
\details
Retrieves name of Binary type in upper case.
\returns Returns a const reference to OdAnsiString that contains Binary type name in upper case.

OdDAI.BinaryType.name
\details
Retrieves name of Binary type in lower case.
\returns Returns a const reference to OdAnsiString that contains Binary type name in lower case.

OdDAI.BinaryType.type
\details
Retrieves the binary type code.
\returns Returns a const pointer to the type code of the binary type.

OdDAI.BinaryType.fixedWidth
\details
Determines whether the binary type has fixed width.
\returns Returns true if the binary type has fixed width; otherwise the method returns false.

OdDAI.BinaryType.width
\details
Retrieves the maximum, or for fixed width the exact, number of bits in a value of the type.
\returns Returns a the number of bits.

OdDAI.BinaryType.#ctor(System.Boolean,System.Int32)
\details
Creates a new binary type object with specified parameters.
\param fixedWidth [in] A flag that determines whether the domain of the created binary type has fixed (equal to true) or variable (equal to false) width.
\param width      [in] A maximum, or for fixed width the exact, number of bits in a value of the type.

OdDAI.BinaryType.#ctor
\details
Creates a new binary type object with default parameters.

OdDAI.BinaryType
\details
A class that implements a data type definition for the EXPRESS SCHEMA BINARY type.